
&НаКлиенте
Процедура Рассчитать(Команда)
	Если Рост = 0 Тогда 
		Сообщить("Укажите рост");
	Иначе
		ИМТ = Вес / (Рост / 100 * 2);  
		
		Если ИМТ <= 16 Тогда
			Элементы.Результат.Заголовок = "Выраженный дефицит массы тела";
		ИначеЕсли ИМТ > 16 И ИМТ <= 18.5 Тогда
			Элементы.Результат.Заголовок = "Недостаток массы тела";
		ИначеЕсли ИМТ > 18.5 И ИМТ <= 25 Тогда
			Элементы.Результат.Заголовок = "Норма";
		ИначеЕсли ИМТ > 25 И ИМТ <= 30 Тогда
			Элементы.Результат.Заголовок = "Избыточная масса тела";
		ИначеЕсли ИМТ > 30 И ИМТ <= 35 Тогда
			Элементы.Результат.Заголовок = "Ожирение первой степени";
		ИначеЕсли ИМТ > 35 И ИМТ <= 40 Тогда
			Элементы.Результат.Заголовок = "Ожирение второй степени";
		ИначеЕсли ИМТ > 40 Тогда
			Элементы.Результат.Заголовок = "Ожирение третьей степени";
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
